src/InformationRegisters/ОстаткиПоРазмещению/ОстаткиПоРазмещению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОстаткиПоРазмещению</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПриблизительно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Размещение</name>
    <type>
      <types>CatalogRef.Размещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/Местоположения/Местоположения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Местоположения</name>
  <enumValues>
    <name>Дача</name>
  </enumValues>
  <enumValues>
    <name>Дом</name>
  </enumValues>
  <enumValues>
    <name>Автомобиль</name>
  </enumValues>
  <enumValues>
    <name>Ватутинки</name>
  </enumValues>
  <enumValues>
    <name>ЧеховМолодежная</name>
  </enumValues>
  <enumValues>
    <name>Корзина</name>
  </enumValues>
  <enumValues>
    <name>Перемещаемое</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
  <enumValues>
    <name>Несколько</name>
  </enumValues>
  <enumValues>
    <name>Неопределено</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоПриобретения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Местоположение</name>
    <type>
      <types>EnumRef.Местоположения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Сайт</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПриблизительно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРазмещения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыделитьЦветом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпьютернаяСборкаЕстьСвободные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпьютернаяСборкаКомпонент</name>
    <comment>это компонент компьютерной сборки</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>QR_Code</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтикеткаРаспечатана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/НоменклатураСервер/Module.bsl
#Область РегистрСведенийРазмещениеОстатки

Процедура ИзменитьРазмещение(п_Номенклатура, п_РазмещениеНовое, п_РазмещениеСтарое = "", п_Количество = 1) Экспорт

	НаборЗаписей = РегистрыСведений.ОстаткиПоРазмещению.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Размещение.Установить(п_РазмещениеСтарое);
	НаборЗаписей.Отбор.Номенклатура.Установить(п_Номенклатура);
	НаборЗаписей.Прочитать(); 

	МЗ = РегистрыСведений.ОстаткиПоРазмещению.СоздатьМенеджерЗаписи();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		Для Каждого Запись Из НаборЗаписей Цикл 
			ЗаполнитьЗначенияСвойств(МЗ, Запись);
			МЗ.Прочитать();
			МЗ.Размещение = п_РазмещениеНовое;
			МЗ.Записать();
		КонецЦикла;
	Иначе
		МЗ.Номенклатура	= п_Номенклатура;
		МЗ.Размещение	= п_РазмещениеНовое;
		МЗ.Количество	= п_Количество;
		МЗ.ДатаСобытия	= ТекущаяДатаСеанса();
		МЗ.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура ОчиститьРазмещения(п_Номенклатура) Экспорт

	НаборЗаписей = РегистрыСведений.ОстаткиПоРазмещению.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Номенклатура.Установить(п_Номенклатура);
	НаборЗаписей.Записать();

КонецПроцедуры

Процедура УдалитьРазмещение(п_Номенклатура, п_Размещение) Экспорт

	МЗ = РегистрыСведений.ОстаткиПоРазмещению.СоздатьМенеджерЗаписи(); 
	МЗ.Номенклатура = п_Номенклатура;
	МЗ.Размещение = п_Размещение;
	МЗ.Удалить();

КонецПроцедуры

Функция ПолучитьКоличествоПоРазмещению(п_Номенклатура, п_Размещение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиПоРазмещению.Количество КАК Количество
		|ИЗ
		|	РегистрСведений.ОстаткиПоРазмещению КАК ОстаткиПоРазмещению
		|ГДЕ
		|	ОстаткиПоРазмещению.Номенклатура = &Номенклатура
		|	И ОстаткиПоРазмещению.Размещение = &Размещение";
	
	Запрос.УстановитьПараметр("Номенклатура", п_Номенклатура);
	Запрос.УстановитьПараметр("Размещение", п_Размещение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Количество;
	КонецЕсли;

	Возврат 0;

КонецФункции // ()

Процедура УстановитьКоличествоПоРазмещению(п_Номенклатура, п_Размещение, п_Количество) Экспорт

	МЗ = РегистрыСведений.ОстаткиПоРазмещению.СоздатьМенеджерЗаписи();
	МЗ.Номенклатура	= п_Номенклатура;
	МЗ.Размещение	= п_Размещение;
	МЗ.Количество	= п_Количество;
	МЗ.ДатаСобытия	= ТекущаяДатаСеанса();
	МЗ.Записать();

КонецПроцедуры // ()

Функция ПолучитьОстатки(п_Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиПоРазмещению.Количество КАК Количество,
		|	ОстаткиПоРазмещению.Размещение КАК Размещение
		|ИЗ
		|	РегистрСведений.ОстаткиПоРазмещению КАК ОстаткиПоРазмещению
		|ГДЕ
		|	ОстаткиПоРазмещению.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", п_Номенклатура);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции // ()

Функция ПолучитьРазмещения(п_Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиПоРазмещению.Размещение КАК Размещение
		|ИЗ
		|	РегистрСведений.ОстаткиПоРазмещению КАК ОстаткиПоРазмещению
		|ГДЕ
		|	ОстаткиПоРазмещению.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", п_Номенклатура);
	
	Рез = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Размещение");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Размещения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Размещения КАК Размещения
		|ГДЕ
		|	Размещения.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", п_Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если Рез.Найти(Выборка.Ссылка) = Неопределено Тогда
			Рез.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЕсли;

	Возврат Рез;
	
КонецФункции // ()

Функция ПолучитьНомерРазмещения(п_Номенклатура) Экспорт

	Если НЕ ЗначениеЗаполнено(п_Номенклатура) Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиПоРазмещению.Номенклатура КАК Номенклатура,
		|	ОстаткиПоРазмещению.Размещение КАК Размещение,
		|	ОстаткиПоРазмещению.Количество КАК Количество
		|ИЗ
		|	РегистрСведений.ОстаткиПоРазмещению КАК ОстаткиПоРазмещению
		|ГДЕ
		|	ОстаткиПоРазмещению.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", п_Номенклатура);
	КоличестоМест = Запрос.Выполнить().Выбрать().Количество();
	
	Рез = 0;
	
	Если КоличестоМест = 0 Тогда

		Запрос1 = Новый Запрос;
		Запрос1.Текст = 
			"ВЫБРАТЬ
			|	Размещения.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Размещения КАК Размещения
			|ГДЕ
			|	Размещения.Номенклатура = &Номенклатура";
		
		Запрос1.УстановитьПараметр("Номенклатура", п_Номенклатура);
		
		Выборка1 = Запрос1.Выполнить().Выбрать();
		
		Если Выборка1.Следующий() Тогда
			Рез = 3; // желтый
		КонецЕсли;

	ИначеЕсли КоличестоМест = 1 Тогда
		Рез = 1; // синий
	Иначе
		Рез = 2; // зеленый
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции // ()

Функция ПолучитьМестоположениеПоРазмещению(п_Узел) Экспорт
	
	Если ТипЗнч(п_Узел) = Тип("СправочникСсылка.Размещения") Тогда
		 МассивУзлов = Новый Массив;
		 МассивУзлов.Добавить(п_Узел);
	ИначеЕсли ТипЗнч(п_Узел) = Тип("Массив") Тогда
		 МассивУзлов = п_Узел;
	Иначе
		 Возврат "Не определено";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Размещения.Ссылка КАК Размещение,
		|	ВЫБОР
		|		КОГДА Размещения.Ссылка В ИЕРАРХИИ (&УзелДача)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Местоположения.Дача)
		|		КОГДА Размещения.Ссылка В ИЕРАРХИИ (&УзлыДом)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Местоположения.Дом)
		|		КОГДА Размещения.Ссылка В ИЕРАРХИИ (&УзелАвтомобиль)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Местоположения.Автомобиль)
		|		КОГДА Размещения.Ссылка В ИЕРАРХИИ (&УзелВатутинки)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Местоположения.Ватутинки)
		|		КОГДА Размещения.Ссылка В ИЕРАРХИИ (&УзелЧеховМолодежная)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Местоположения.ЧеховМолодежная)
		|		КОГДА Размещения.Ссылка В ИЕРАРХИИ (&УзелКорзина)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Местоположения.Корзина)
		|		КОГДА Размещения.Ссылка В ИЕРАРХИИ (&УзелАрхив)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.Местоположения.Архив)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.Местоположения.Перемещаемое)
		|	КОНЕЦ КАК Местоположение
		|ИЗ
		|	Справочник.Размещения КАК Размещения
		|ГДЕ
		|	Размещения.Ссылка = &Ссылка";

	УзлыДом = Новый Массив;
	УзлыДом.Добавить(Справочники.Размещения.НайтиПоНаименованию("КОМНАТА ГОСТИНАЯ", Истина));
	УзлыДом.Добавить(Справочники.Размещения.НайтиПоНаименованию("КОМНАТА НАША", Истина));
	УзлыДом.Добавить(Справочники.Размещения.НайтиПоНаименованию("КОМНАТА ФЕДОРА", Истина));
	УзлыДом.Добавить(Справочники.Размещения.НайтиПоНаименованию("КУХНЯ", Истина));
	УзлыДом.Добавить(Справочники.Размещения.НайтиПоНаименованию("ЛОДЖИЯ", Истина));
	УзлыДом.Добавить(Справочники.Размещения.НайтиПоНаименованию("ПРИХОЖКА", Истина));

	Запрос.УстановитьПараметр("УзлыДом",				УзлыДом);
	Запрос.УстановитьПараметр("УзелДача",				Справочники.Размещения.НайтиПоНаименованию("ДАЧА", Истина));
	Запрос.УстановитьПараметр("УзелАвтомобиль",			Справочники.Размещения.НайтиПоНаименованию("АВТОМОБИЛЬ", Истина));
	Запрос.УстановитьПараметр("УзелВатутинки",			Справочники.Размещения.НайтиПоНаименованию("ВАТУТИНКИ", Истина));
	Запрос.УстановитьПараметр("УзелЧеховМолодежная",	Справочники.Размещения.НайтиПоНаименованию("ЧЕХОВ МОЛОДЕЖНАЯ", Истина));
	Запрос.УстановитьПараметр("УзелКорзина",			Справочники.Размещения.НайтиПоНаименованию("- КОРЗИНА -", Истина));
	Запрос.УстановитьПараметр("УзелАрхив",				Справочники.Размещения.НайтиПоНаименованию("00 АРХИВ", Истина));

	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Размещение",		Новый ОписаниеТипов("СправочникСсылка.Размещения"));
	ТЗ.Колонки.Добавить("Местоположение",	Новый ОписаниеТипов("ПеречислениеСсылка.Местоположения"));

	Для каждого Узел Из МассивУзлов Цикл
	
		Запрос.УстановитьПараметр("Ссылка", Узел);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СтрокаТЗ = ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЗ, Выборка);
		КонецЕсли;
	КонецЦикла;

	ТЗ.Свернуть("Местоположение");

	Если ТЗ.Количество() > 1 Тогда
		Возврат Перечисления.Местоположения.Несколько;
	ИначеЕсли ТЗ.Количество() = 1 Тогда
		Возврат ТЗ[0].Местоположение;
	Иначе
		Возврат Перечисления.Местоположения.Неопределено;
	КонецЕсли;
	
КонецФункции // ()

Функция ПроверитьКоличествоРазмещений(п_МассивНоменклатура) Экспорт

	Для каждого Т Из п_МассивНоменклатура Цикл
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОстаткиПоРазмещению.Номенклатура КАК Номенклатура,
			|	ОстаткиПоРазмещению.Размещение КАК Размещение,
			|	ОстаткиПоРазмещению.Количество КАК Количество
			|ИЗ
			|	РегистрСведений.ОстаткиПоРазмещению КАК ОстаткиПоРазмещению
			|ГДЕ
			|	ОстаткиПоРазмещению.Номенклатура = &Номенклатура";
		
		Запрос.УстановитьПараметр("Номенклатура", Т);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Количество() > 1 Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;	

	Возврат Ложь;
	
КонецФункции // ()

Процедура УстановитьВариантРазмещения(п_Номенклатура) Экспорт
	
	Об = п_Номенклатура.ПолучитьОбъект();

	МассивУзлов 			= НоменклатураСервер.ПолучитьРазмещения(п_Номенклатура);
	
	Об.Местоположение		= ПолучитьМестоположениеПоРазмещению(МассивУзлов);
	Об.ВариантРазмещения	= ПолучитьНомерРазмещения(п_Номенклатура);

	Попытка
		Об.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

Процедура УстановитьКоличество(п_Номенклатура, п_Количество) Экспорт
	
	Об = п_Номенклатура.ПолучитьОбъект();
	Об.Количество = п_Количество;

	Попытка
		Об.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область РегистрСведенийЦеныНоменклатуры

Процедура ОчиститьЦены(п_Номенклатура) Экспорт

	НаборЗаписей = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Номенклатура.Установить(п_Номенклатура);
	НаборЗаписей.Записать(); 

КонецПроцедуры

Процедура УстановитьЦены(п_Номенклатура, МассивЦен) Экспорт
	
	НаборЗаписей = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.Номенклатура.Установить(п_Номенклатура); 

	Для Каждого Т Из МассивЦен Цикл 
		НоваяЗапись = НаборЗаписей.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Т);
		НоваяЗапись.Номенклатура = п_Номенклатура;
	КонецЦикла; 

	НаборЗаписей.Записать();	

КонецПроцедуры

Процедура УстановитьЦену(п_Номенклатура, п_Цена, п_ВидЦены, п_ДатаЦены) Экспорт
	
	Если ТипЗнч(п_ВидЦены) = Тип("Строка") Тогда
		п_ВидЦены = Справочники.ВидыЦен.НайтиПоНаименованию(п_ВидЦены, Истина);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(п_ДатаЦены) Тогда
		п_ДатаЦены = ТекущаяДатаСеанса();
	КонецЕсли;
	
	МЗ = РегистрыСведений.ЦеныНоменклатуры.СоздатьМенеджерЗаписи();
	МЗ.Период		= п_ДатаЦены;
	МЗ.Номенклатура = п_Номенклатура;
	МЗ.ВидЦены		= п_ВидЦены;
	МЗ.Цена			= п_Цена;

	Попытка
		МЗ.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

Функция ПолучитьЦену(п_Номенклатура, п_ВидЦены) Экспорт
	
	Рез = Новый Структура("Цена, Дата", 0, Дата('00010101'));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
		|	ЦеныНоменклатурыСрезПоследних.Период КАК Дата
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
		|ГДЕ
		|	ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены
		|	И ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию(п_ВидЦены, Истина));
	Запрос.УстановитьПараметр("Номенклатура", п_Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Рез, Выборка);
	КонецЕсли;

	Возврат Рез;

КонецФункции // ()

Функция ПолучитьЦены(п_Номенклатура) Экспорт
	
	Рез = Новый Структура("ЦенаНаДату, ЦенаПриобретения, ДатаПриобретения");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЦеныНоменклатурыСрезПоследних.ВидЦены.Наименование = ""На дату""
		|				ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
		|		КОНЕЦ) КАК ЦенаНаДату,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЦеныНоменклатурыСрезПоследних.ВидЦены.Наименование = ""Приобретение""
		|				ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
		|		КОНЕЦ) КАК ЦенаПриобретения,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЦеныНоменклатурыСрезПоследних.ВидЦены.Наименование = ""Приобретение""
		|				ТОГДА ЦеныНоменклатурыСрезПоследних.Период
		|		КОНЕЦ) КАК ДатаПриобретения
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
		|ГДЕ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", п_Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Рез, Выборка);
	КонецЕсли;

	Возврат Рез;

КонецФункции // ()

Функция ПолучитьМассивЦен(п_МассивНоменклатуры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатуры.Период КАК Период,
		|	ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатуры.ВидЦены КАК ВидЦены,
		|	ЦеныНоменклатуры.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|ГДЕ
		|	ЦеныНоменклатуры.Номенклатура В(&Номенклатура)";
	
	Запрос.УстановитьПараметр("Номенклатура", п_МассивНоменклатуры);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Рез = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		СтрокаЦен = Новый Структура("Период, Номенклатура, ВидЦены, Цена");
		ЗаполнитьЗначенияСвойств(СтрокаЦен, Выборка);
		Рез.Добавить(СтрокаЦен);
	КонецЦикла;
	
	Возврат Рез;

КонецФункции // ()

#КонецОбласти

#Область Корзина

Функция ПолучитьКоличествоНоменклатурыВКорзине() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
      "ВЫБРАТЬ
      |	ОстаткиПоРазмещению.Номенклатура КАК Номенклатура,
      |	ОстаткиПоРазмещению.Размещение КАК Размещение,
      |	ОстаткиПоРазмещению.Количество КАК Количество
      |ИЗ
      |	РегистрСведений.ОстаткиПоРазмещению КАК ОстаткиПоРазмещению
      |ГДЕ
      |	ОстаткиПоРазмещению.Размещение В ИЕРАРХИИ(&Корзина)";
	
	Запрос.УстановитьПараметр("Корзина", ПолучитьУзелКорзины_Группа());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Количество();
	
КонецФункции // ()

Функция ПолучитьУзелКорзины_Элемент() Экспорт
	
	Возврат Справочники.Размещения.НайтиПоНаименованию("- корзина", Истина);

КонецФункции // ()

Функция ПолучитьУзелКорзины_Группа() Экспорт
	
	Возврат Справочники.Размещения.НайтиПоНаименованию("- КОРЗИНА -", Истина);

КонецФункции // ()

#КонецОбласти

#Область Прочее
	
Функция ЭтоГруппа(п_Элемент) Экспорт

	Возврат п_Элемент.ЭтоГруппа;

КонецФункции // ()

Функция ПолучитьМассивРеквизитов(п_МассивНоменклатуры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Комментарий КАК Комментарий,
		|	Номенклатура.МестоПриобретения КАК МестоПриобретения
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&Номенклатура)";
	
	Запрос.УстановитьПараметр("Номенклатура", п_МассивНоменклатуры);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Рез = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		СтрокаРеквизитов = Новый Структура("МестоПриобретения, Комментарий");
		ЗаполнитьЗначенияСвойств(СтрокаРеквизитов, Выборка);
		Рез.Добавить(СтрокаРеквизитов);
	КонецЦикла;
	
	Возврат Рез;

КонецФункции // ()

Процедура УстановитьРеквизиты(п_Номенклатура, п_МассивРеквизитов) Экспорт

	Рез_Комментарий		= "#";
	Рез_МестоПриобретения	= "#";

	Для каждого Т Из п_МассивРеквизитов Цикл
		Если СтрНайти(Рез_Комментарий, Т.Комментарий) = 0 Тогда
			Рез_Комментарий = Рез_Комментарий + ", " + Т.Комментарий;
		КонецЕсли;
		
		Если СтрНайти(Рез_МестоПриобретения, Т.МестоПриобретения) = 0 Тогда
			Рез_МестоПриобретения = Рез_МестоПриобретения + ", " + Т.МестоПриобретения;
		КонецЕсли;
	КонецЦикла;

	Рез_Комментарий			= СтрЗаменить(Рез_Комментарий, "#, ", "");
	Рез_МестоПриобретения	= СтрЗаменить(Рез_МестоПриобретения, "#, ", "");

	Рез_Комментарий			= СтрЗаменить(Рез_Комментарий, "#", "");
	Рез_МестоПриобретения	= СтрЗаменить(Рез_МестоПриобретения, "#", "");
	
	Об = п_Номенклатура.ПолучитьОбъект();
	Об.Комментарий			= Рез_Комментарий;
	Об.МестоПриобретения	= Рез_МестоПриобретения;

	Попытка
		Об.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;


КонецПроцедуры


#КонецОбласти
